# IFC_DeleteIFCInfo

## Description
Removes all IFC data

```pascal
FUNCTION IFC_DeleteIFCInfo(
				hObject : HANDLE;
				bDoUndo : BOOLEAN) : BOOLEAN;
```

```python

def vs.IFC_DeleteIFCInfo(hObject, bDoUndo):
    return BOOLEAN
```

## Parameters
|Name|Type|Description|
|---|---|---|
|hObject|HANDLE||
|bDoUndo|BOOLEAN||

## Version
Availability: from Vectorworks 2017
## Category
* IFC